app/views/home/_search_available_rooms.html.haml

        - @available_rooms.each do |room_id|
          - room = Room.find_by_id(room_id)
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1