app/views/home/book_rooms.html.haml

SELECT `room_categories`.* FROM `room_categories`
---
      = date_field_tag(:end_date, Date.today, class: 'datepicker')
      = select_tag(:room_type, options_for_select(@room_category.map{ |c| [c.category + '(' + c.price.to_s + ' RS' + ')', c.id ]}))