app/views/home/user_dashboard.html.haml

          - @room_id.each do |room_id|
            - room = Room.find_by_id(room_id)
---
SELECT  `rooms`.* FROM `rooms` WHERE (`rooms`.`id` IN (1, NULL) OR `rooms`.`id` IS NULL) LIMIT 1