app/controllers/home_controller.rb

  def user_dashboard
    @room_id = BookingStatus.where(user_id:current_user).pluck(:room_id).uniq
---
SELECT `booking_statuses`.`room_id` FROM `booking_statuses` WHERE `booking_statuses`.`user_id` = 2

  def search_available_rooms
    room_type = params[:room_type].to_i
    start_date = params[:start_date]
    end_date = params[:end_date]
    booked_rooms = find_available_rooms(room_type, start_date, end_date)
    booked_rooms_id = []
    booked_rooms.each do |room|
      booked_rooms_id.push(room.room_id)
    end
    filtered_rooms_on_room_type = RoomCategory.find(room_type).rooms.pluck(:id)
---
SELECT `rooms`.`id` FROM `rooms` WHERE `rooms`.`room_category_id` = 1

  def booked_room
    start_date = Date.parse(params[:start_date])
    end_date = Date.parse(params[:end_date])
    (start_date..end_date).each do |date|
      booked_room = BookingStatus.new(
          start_date: date,
          user_id: current_user.id,
          room_id: params[:room_id]
      )

      booked_room.save
---
INSERT INTO `booking_statuses` (`start_date`, `user_id`, `room_id`, `created_at`, `updated_at`) VALUES ('2016-08-30', 2, 4, '2016-08-30 17:40:15', '2016-08-30 17:40:15')

  def book_rooms
    @room_category= RoomCategory.all
---
SELECT `room_categories`.* FROM `room_categories`